Revit 2024 API
BuiltInFailures.StairRampFailures.AntiparallelRampRisers Property
 Riser lines are parallel but not collinear. Can't build Run between these Risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AntiparallelRampRisers { get; }
Visual Basic
Public Shared ReadOnly Property AntiparallelRampRisers As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AntiparallelRampRisers {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace